# MainPhase_QualityAssessment/dino_yoloV8.yaml

# Number of classes
nc: 2

# Scale (needed to satisfy YOLO's internal hooks)
scales:
  n: [1, 1, 1024]

# Backbone with multiscale outputs
backbone:
  - [null, 0, Helpers_General.Supervised_learning_helpers.Cloned_dino_backbone_for_yolo.DinoV2New,
     [384, "small", "Checkpoints/backbone_ExId_854681636342556727_run_20250428_154510_BEST_dinov2_selfsup_trained.pt"]]
  - [-1, 1, Helpers_General.Supervised_learning_helpers.lambda_helper.TupleSelect, [0]]  # 256x16x16
  - [-2, 1, Helpers_General.Supervised_learning_helpers.lambda_helper.TupleSelect, [1]]  # 512x8x8
  - [-3, 1, Helpers_General.Supervised_learning_helpers.lambda_helper.TupleSelect, [2]]  # 1024x4x4

# Head (takes multiscale features)
head:
  - [[-1, -2, -3], 1, Detect, [nc]]
